{
  "business_info": {
    "name": "24 Hours Pure Water",
    "rating": 4.7,
    "review_count": 46,
    "address": null,
    "phone": "(310) 532-1962",
    "url": "https://www.yelp.com/biz/24-hours-pure-water-gardena-2?osq=24+Hours+Pure+Water"
  },
  "reviews": [
    {
      "id": "",
      "name": "Cheryl T.",
      "rating": 5,
      "comment": "Not just great tasting water but customer service is always welcoming and you're greeted with a smile. The price is right for Alkaline water and cheaper than anywhere I've checked. The owner will also test the water if you're skeptical or just want to see how pure it is.\nThere two Alkaline water stations inside along with a few regular water stations. You can rinse you water jugs before filling and there are also some snacks for purchase at a reasonable price.\nI will remain a loyal customer as long as owners stay and water remains the same. \nThere's also parking right in front of the shop along with outdoor filling station as well. Convenience at it's best :)\nThank you for your service!",
      "date": "2025-06-06T17:25:45Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Alex B.",
      "rating": 5,
      "comment": "Great water spot and I'm impressed $5 for 5 gallons of alkaline water is a great deal. You can definitely taste difference in water.",
      "date": "2025-07-14T23:24:30Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Angie G.",
      "rating": 5,
      "comment": "This is a great water store. It is conveniently located off of Redondo Beach Blvd and there's parking available right outside of the shop. The owner is very friendly and nice, the prices are reasonable, and it's a clean and organized shop. I like that there are carts available if you are carrying more than 1 water jug. And, the most important part, the water tastes delicious. They have regular filtered/reverse osmosis water and alkaline. I always choose the filtered water and it tastes amazing, and I'm picky about water. Great shop overall",
      "date": "2024-11-10T02:52:33Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Anonymous M.",
      "rating": 5,
      "comment": "OMG a water expert came to my house today and checked the quality of the water sold at this store and it was SO clean. The expert said the result has to be between 0 to 50 on her reader. It can't be higher than 50. The result was a 1. She said the water from this store is VERY high quality. \n\nMy tap water was 129 and she said it's not safe. She recommended I wash my hair and skin with the water from this store.",
      "date": "2024-09-29T03:55:27Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "maria fidelina c.",
      "rating": 5,
      "comment": "Good service, very clean , good price , water tested good . Open on Sundays ,  location . Parking",
      "date": "2024-07-14T05:23:21Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Jay A.",
      "rating": 5,
      "comment": "They have great service and clean water. What more do you need?  \n\nThe location is easily accessible and parking is easy if you have big jugs of water. Highly recommended.",
      "date": "2022-05-25T15:36:08Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Jasmine A.",
      "rating": 5,
      "comment": "Right when we walked in we were greeted with a warm smile from the man working there. He was so kind, and knowledgeable. We filled up our bottle with 5gal of alkaline water & got 2 caps for our bottles since ours were broken. He took zelle which was awesome & overall had a great experience! Small store but overall felt welcome. Will definitely be back!",
      "date": "2023-03-14T03:19:39Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "April V.",
      "rating": 5,
      "comment": "This place is self service but they have enough fossits to fill up your water jugs quickly. The place is clean. The store is just kinda hidden and wasn't easy to find at first. Especially if you're coming from the other side or the street. The water tastes good. I would come here more often if it was an easier place to find. I like this place also bc during business hours, they accept venmo as a payment option.",
      "date": "2023-03-05T10:12:23Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Joy U.",
      "rating": 5,
      "comment": "Let me tell you, I've been to plenty of water places but this one is the best! The owner is so sweet and completely explains the difference in material of the bottles and helps you choose what is most cost effective. You can walk in and put water in your containers on your own, pay and walk out. Its fast, easy and convienant. They also have water dispensers outside if the inside is closed, though one our of two was not working. Compared to the pricing of a lot of water places in the area i'm definitely going back to this one.",
      "date": "2020-06-02T18:10:43Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Emerson J.",
      "rating": 5,
      "comment": "Great service. The prices are really good and reasonable. Water dispenser outside available.",
      "date": "2023-11-04T03:39:29Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Isai R.",
      "rating": 5,
      "comment": "This spot has THE best prices in the region for your water needs. Also, it's really convenient that they take payments via Venmo/Zelle/Cash app. And if all this wasn't enough, the owner is super friendly. I'm always greeted with a smile and always treated with nothing but respect and courtesy.",
      "date": "2022-05-12T00:03:27Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Jaime D.",
      "rating": 5,
      "comment": "Really good service and the staff is super friendly! The place is really nicely decorated as well!",
      "date": "2023-07-27T17:29:06Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Hap P.",
      "rating": 5,
      "comment": "This is my water spot ever since they were across the street next to KBBQ. I wonder if The Habit is haunted by ghosts of gallons past. I mostly roll early in the morning or late at night so I can back the car into movie star parking. Price jumped up to 30 cents a gallon a couple years ago, but that's ok. The owner suggested bottles and they haven't failed us after several years. Use that spare change you got and buy a couple Redvines.",
      "date": "2020-06-26T01:51:19Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Cindy T.",
      "rating": 3,
      "comment": "Machine on the right are my $1  let me know how I can get credit the next time I have to fill up!",
      "date": "2019-11-04T03:36:15Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "LaVette A.",
      "rating": 1,
      "comment": "I've been going to this water store for at least 10 months now, maybe longer and I was satisfied for the most part. Water is good quality, I usually get the alkaline, and it's clean there but my only complaint is about the owner. I was trying to hold off on saying anything and just move on but I cannot. He's actually quite rude and I will not give him a pass for that any longer. I'm not sure if he's just generally a gruff individual or if he has an issue with me. I say this because I have observed how he greets and interacts with others versus his behavior when interacting with me. It's happened far too often and I don't know what the hell I was thinking by continuing to patronize a business where I feel this way after having gone there. I went there yesterday and still feeling the ill affects of our interaction. Well, no more. I will not be returning. There are other water stores I can try and I have no problem driving the extra distance to utilize their services. And to the owner, do something about your attitude and treatment of ALL customers, not just the ones you feel are deserving of being kissed up to. \n\n5 stars for the water\n1 star for poor disposition and customer service. I'd give less but it won't let me.",
      "date": "2020-09-25T15:32:04Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Theresa N.",
      "rating": 5,
      "comment": "I have been coming here for years to get water. The staff are friendly and the water always taste good.",
      "date": "2022-09-09T17:17:00Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Uncle K.",
      "rating": 1,
      "comment": "Been going here for 10+ years. Dont know if the owners changed but they are super rude. Apparently they do not take coins and they started yelling at me. Never had any problems is but one day they snapped at me. Told me to never come back again.",
      "date": "2022-04-16T04:13:55Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Edgar P.",
      "rating": 4,
      "comment": "I go here at least once a week to refill the water containers. There are several vending places or machines in the area but I feel that this place has the best quality of drinking water.\nBusiness is located on Redondo Beach across from the McDonald's and next to Jan Soo. Owner is nice and courteous and the prices are reasonable and similar to other places, .25 cents per gallon, or get a prepaid card for 100 gallons at $20.00 (.20 cents) but you can only use it during business hours since its stamped and would not work on the 24 hour vending machines.\nBusiness also sells water container and bottles of different sizes and accessories.",
      "date": "2012-07-24T05:07:23Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Oscar N.",
      "rating": 5,
      "comment": "Nice place to go refill water. The owner is cool.  The cheapest alkaline water that I could found 5 dollars to refill. I go every week for my water. You can pay in cash or apps. The parking is easy to get in and out.",
      "date": "2020-10-30T19:41:31Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Keith F.",
      "rating": 4,
      "comment": "Been using this place alternately with the one on the other side of Normandie (Good Drinking Water) to fillup two 5 gallon bottled water from the 2 vending machines outside for my workplace. \nSo I guess service is good since I go early in the morning.\nWater tastes good.",
      "date": "2018-08-06T18:37:51Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Brad K.",
      "rating": 5,
      "comment": "Jerry is the best! I've been a customer for 10+ years at his old location and now the new location.\n\nThe water is great, but his friendliness and service is what separates him from the rest. He also offers ALKALINE water along with the purified water.\n\nHe offers a great special. A $20 card for 100 gallons. $.20 per gallon, can't beat that. \n\nHINT! - The best day to go is on Tuesday because Burnt Tortilla is closed so there is a lot more parking available.",
      "date": "2017-05-17T17:07:03Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Iyoni Y.",
      "rating": 5,
      "comment": "Hidden gem of Gardena. This place offers alkaline water at a really low price. When you get 10+ gallons the alkaline water is only $1  per gallon.. you can't beat the deal.. the owner is a sheer delight and the store is incredibly clean!!!!",
      "date": "2017-07-10T18:23:21Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "David M.",
      "rating": 5,
      "comment": "Did some research and found that there are many benefits to alkaline water. Cant really say i notice the difference, but when you get alkaline water at a low price, why not? It can only be good for you!\n\nI get my alkaline water here and its priced really well, store is very clean and the service is great! There werent too many store that have alkaline water at this price, so this store is a clear winner!\nI love supporting small businesses and its even better when theyre friendly, low prices, good product.",
      "date": "2017-08-29T20:08:10Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Elbert J.",
      "rating": 5,
      "comment": "Best place best water prices.  Love the service and love the location. They offer alkaline water. And also the best freshwater also.",
      "date": "2017-05-20T22:52:09Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Kami P.",
      "rating": 5,
      "comment": "This water store is the best.  They have a few options of water to select from (ie. Alkaline). They also sell water containers.    With  great tasting water and a spotless facility and very reasonable prices, I recommend the 24 Hour Water Store.",
      "date": "2020-01-05T06:17:07Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Cassie D.",
      "rating": 5,
      "comment": "Jerry was amazing!!! service was excellent establishment was very clean. I would recommend this place for Alkaline water services. 1-3 gallons 1.25 very reasonable prices.",
      "date": "2018-09-17T21:00:14Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Dawn N.",
      "rating": 5,
      "comment": "I have been coming here for the past few months and I have no complaints!! Jerry is the nicest man you will ever meet and his alkaline water is the best price in town. 1.25 per gallon, can't beat that!!",
      "date": "2018-06-02T18:13:35Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Daniel P.",
      "rating": 5,
      "comment": "Jerry is very friendly and his store is clean and well maintained. The water here is very tasty!!! The prices are great also, 25 cents for purified water and only 1.00 for alkaline when you buy 4. Great store!!!",
      "date": "2018-09-14T20:50:26Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Nicole X.",
      "rating": 5,
      "comment": "Jerry is SO friendly and the service here us excellent! My friend told me to come here because he has the best prices for Alkaline water (and regular water too). I just got a new water machine for my house, FINALLY. So I came here, purchased 2 5gal jugs and had them filled with goodness. So glad I know about this place, the service is just as great as the prices so I will definitely be coming back for my refills!",
      "date": "2018-08-11T22:41:39Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Jose D.",
      "rating": 5,
      "comment": "I've been coming here for years  Water is great the price is cheap! The guy running the place is very nice and helpful. Would highly recommend! They also carry alkaline water for those interested.",
      "date": "2018-07-01T01:14:14Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Randi W.",
      "rating": 5,
      "comment": "I've been getting my filtered water from Jerry for a little over 7 years now.  I'm glad he only moved across the street from his old place. The water is always clean and crisp, never any flavor. The water is $.25 a gallon, which is better than the grocery stores that charge upwards of $.35/gallon.  I'll always get my water from here and I hope this places stays open forever because it's literally the best h2o in Gardena.",
      "date": "2017-12-02T23:04:39Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Ai M.",
      "rating": 4,
      "comment": "The owner is awesome!  Very helpful, friendly, and knowledgeable.  He keeps the place clean and he has really great rates for water and alkaline water!!",
      "date": "2017-11-15T07:17:20Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Cel L.",
      "rating": 5,
      "comment": "The best spot to get water. You can rinse out your containers and they provide towels to wipe them down. Great service!Now that's some high quality H2O!",
      "date": "2017-09-02T00:37:06Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Mr N.",
      "rating": 5,
      "comment": "Amazing service and water..family owed..this family cares..always leaves me with a smile..can't beat the price Alkaline water 1-3 gallon for a $1.25 anything over that it is only a $1..that's right a dollar a gallon for Alkaline water",
      "date": "2019-09-12T00:16:16Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Candace D.",
      "rating": 5,
      "comment": "Very friendly and fun service. Yes fun, at the water store. The water is the best around and the prices are right. We don't live in the area but we make the trip weekly because it's worth it!!!",
      "date": "2017-08-10T19:19:29Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Karen S.",
      "rating": 5,
      "comment": "Facility is clean which is very important to me; service is friendly and helpful.  Had the alkaline water tested and measured up; save incredibly Love the water from 24 Hours Pure Water No complaints.  Will recommend this place to anyone.",
      "date": "2018-05-16T18:44:32Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Kiara K.",
      "rating": 5,
      "comment": "We get our Alkaline water here all the time! Taste good and no hassle and owner is nice. Get some lunch at burnt tortilla and ice cream at basin robbins at the same time so its a great stop!",
      "date": "2017-07-08T22:46:58Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Bert B.",
      "rating": 5,
      "comment": "This place is great and they have the best alkaline water. The owner will test the water in front of you to show you it's real! The water is best tasting water. Always come here! I highly recommend this place!",
      "date": "2017-12-21T22:02:02Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Rie O.",
      "rating": 5,
      "comment": "Small store with a hectic parking lot. I went around lunch time on a weekend. Service was fast. I noticed they sell water jugs at better prices than I've seen around. They also have carts so you can wheel your load out to the car. This is so helpful, this is the first water store that offered a cart.",
      "date": "2016-07-31T02:37:45Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Aisha I.",
      "rating": 5,
      "comment": "This is the best water store in the Gardena area. The service is fast and friendly. I have no complaints and the price for alkaline water is unbeatable. My water store from now on.",
      "date": "2018-01-23T23:02:40Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Ramzy S.",
      "rating": 5,
      "comment": "Great store, great service, the manager is very helpful all the time with great costumer service and great pricing",
      "date": "2018-12-03T21:02:20Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Sexy D.",
      "rating": 5,
      "comment": "I love their water it's great I have had water at other places and it was not nearly as good as this place. My husband is super picky and he enjoys it as well.",
      "date": "2018-04-10T23:52:00Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Karl R.",
      "rating": 5,
      "comment": "Just stumbled across this Gem while having dinner next door at burnt tortilla! Very clean, great service and the owner was great and allowed me to sample the purified and alkaline water. You can bring your own container or purchase one from him!",
      "date": "2018-02-25T01:06:18Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Jason N.",
      "rating": 5,
      "comment": "I have been buying water from this store since they were next to 99 cent store. Jerry the owner is a very nice person. The store is clean. Regular water is great and taste better than our filter water at home. The alkaline water is the lowest price I could find. Buy the $20 card which will cost only $0.20 per gallon",
      "date": "2017-10-10T23:50:34Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "Rebecca T.",
      "rating": 5,
      "comment": "I absolutely LOVE getting my water here. It tastes so good and the prices are great. The owner JERRY is one of the most pleasant people I have ever met. Always a big smile and one of the main reasons I go back.  I also love the Alkaline water option!",
      "date": "2015-09-11T04:11:33Z",
      "verified": true,
      "yelp_url": ""
    },
    {
      "id": "",
      "name": "John T.",
      "rating": 5,
      "comment": "Best price for alkaline water. Great service and hours of operation. Will be back here for all my water needs.",
      "date": "2018-01-10T22:21:37Z",
      "verified": true,
      "yelp_url": ""
    }
  ],
  "fetched_at": "2025-08-09T22:31:11.537163"
}